#+title: Org-mode workflow for exploratory analysis of data
#+date: <2021-09-22 Wed>
#+lastmod: 2021-10-25 10:11:20
#+author: Nasser Alkmim
#+draft: t
#+toc: t
#+tags[]: tools workflow emacs org-mode latex
*** Example noweb for imports

First create a block with imports with a name:

#+begin_example
#+name: import
#+begin_src python
import numpy as np
#+end_src
#+end_example

#+name: import
#+begin_src python :noweb yes
import numpy as np
#+end_src

#+RESULTS: import


Then use it with noweb reference.
#+begin_example
#+begin_src python :noweb yes :exports both
<<import>>
print(np.array(1))
#+end_src
#+end_example

Which results in:
#+begin_src python :noweb yes :exports both
<<import>>
print(np.array(1))
#+end_src

#+RESULTS:
: 1

Notice that above the =<<import>>= is shown, this is because the Hugo org conversion is not the same as the default html export , see [[https://github.com/niklasfasching/go-org][GitHub - niklasfasching/go-org: Org mode parser with html & pretty printed or...]].
In the default html export the noweb reference syntax is not shown in the block that it is used.
You can even control if the reference should expand the original code.
_This is good for avoid repetition,_ but it is a behavior that can be controlled with a header argument.

** Use variables from previous blocks?

Lets say you do a calculation in multiple blocks,

#+name: A
#+begin_src python :exports both
calc_A = 6
print(calc_A)
#+end_src

#+RESULTS: A
: 6


#+name: B
#+begin_src python :exports both :results scalar
calc_B = 8
print(calc_B)
#+end_src

#+RESULTS: B
: 8


Then you want to create a summary table with those results.
You can do with a noweb reference:

#+begin_src python :exports both
<<A>>
<<B>>
import pandas as pd
print(type(calc_A))
df = pd.DataFrame({'A': [calc_A], 'B': [calc_B]})
print(df)
#+end_src

#+RESULTS:
: 6
: 8
: <class 'int'>
:    A  B
: 0  6  8

Notice that since we =print(calc_A)= in the original block, this is repeated here.
As an alternative we can pass a header argument with the blocks names.

#+begin_example
#+begin_src python :var calc_A=A calc_B=B
#+end_example

#+begin_src python :var calc_A=A calc_B=B :exports both
import pandas as pd
df = pd.DataFrame({'A': [calc_A], 'B': [calc_B]})
print(type(calc_A))
print(df)
#+end_src

#+RESULTS:
: <class 'str'>
:      A    B
: 0  6\n  8\n

Not the results from the block is interpreted as a string.

